Задание 1
Скачайте с сайта датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
film = pd.read_csv('movies.csv')

In [3]:
film.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rating = pd.read_csv('ratings.csv')

In [5]:
rating.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [6]:
df = film.merge(rating, on = 'movieId')

In [7]:
df.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2,3.5,1141415820
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,1439472215
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,4,3.0,1573944252
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,858625949
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,890492517

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25000095 entries, 0 to 25000094
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   movieId    int64
 1   title      object
 2   genres     object
 3   userId     int64
 4   rating     float64
 5   timestamp  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.3+ GB

In [12]:
df[df.rating == 5]['title'].value_counts().head(5)

Shawshank Redemption, The (1994)             39553
Pulp Fiction (1994)                          32169
Forrest Gump (1994)                          25918
Star Wars: Episode IV - A New Hope (1977)    25804
Matrix, The (1999)                           25482
Name: title, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

НЕ ВЫПОЛНИЛ ТАК КАК НЕТ ФАЙЛА Power.csv я его не нашел

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas DataFrame. Вы можете взять любые страницы.
Примеры страниц:

In [13]:
kurs = pd.read_html('https://fortrader.org/quotes')[0]
kurs.head()

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  90.79        0.0           0.0        NaN
1       USDRUB Курс рубля к доллару  83.26        0.0           0.0        NaN

In [15]:
coin = pd.read_html('https://fortrader.org/quotes')[7]
coin.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Bitcoin Курс биткоина,26 406.80,-14.60,-0.06,NaN
1,Litecoin Курс лайткоин к доллару (LTC/USD),76.562,-0.377,-0.490,NaN
2,BitcoinCash Курс Биткоин кеш к доллару США (BC...,116.465,нет данных,нет данных,NaN
3,Dash Dash,30.884,-0.272,-0.873,NaN
4,Ripple Ripple,0.47402,-0.00569,-1.18613,NaN